Glass.Data/Web References/wsPMSNFeAutorizacao/NFeAutorizacao4.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="NFeAutorizacao4" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/ws/NFeAutorizacao4?xsd=1" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4" />
    </xsd:schema>
  </types>
  <message name="nfeAutorizacaoLote">
    <part name="nfeDadosMsg" element="tns:nfeDadosMsg" />
  </message>
  <message name="nfeAutorizacaoLoteResponse">
    <part name="nfeResultMsg" element="tns:nfeResultMsg" />
  </message>
  <message name="nfeAutorizacaoLoteZIP">
    <part name="nfeDadosMsgZip" element="tns:nfeDadosMsgZip" />
  </message>
  <message name="nfeAutorizacaoLoteZIPResponse">
    <part name="nfeResultMsg" element="tns:nfeResultMsg" />
  </message>
  <portType name="NFeAutorizacaoSoap">
    <operation name="nfeAutorizacaoLote">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLote" message="tns:nfeAutorizacaoLote" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/NFeAutorizacaoSoap/nfeAutorizacaoLoteResponse" message="tns:nfeAutorizacaoLoteResponse" />
    </operation>
    <operation name="nfeAutorizacaoLoteZIP">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLoteZIP" message="tns:nfeAutorizacaoLoteZIP" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/NFeAutorizacaoSoap/nfeAutorizacaoLoteZIPResponse" message="tns:nfeAutorizacaoLoteZIPResponse" />
    </operation>
  </portType>
  <binding name="nfeAutorizacaoSoap12Binding" type="tns:NFeAutorizacaoSoap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="nfeAutorizacaoLote">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLote" />
      <input>
        <soap12:body use="literal" />
      </input>
      <output>
        <soap12:body use="literal" />
      </output>
    </operation>
    <operation name="nfeAutorizacaoLoteZIP">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4/nfeAutorizacaoLoteZIP" />
      <input>
        <soap12:body use="literal" />
      </input>
      <output>
        <soap12:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="NFeAutorizacao4">
    <port name="nfeAutorizacaoSoap12" binding="tns:nfeAutorizacaoSoap12Binding">
      <soap12:address location="https://nfe.fazenda.ms.gov.br:443/ws/NFeAutorizacao4" />
    </port>
  </service>
</definitions>